---
kind: method
id: M:Autodesk.Revit.DB.ElementSet.GetEnumerator
source: html/c9469c4b-5767-8694-0e1c-b3e39d5cfa88.htm
---
# Autodesk.Revit.DB.ElementSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.